J20RC/STM32_RC_Transmitter/software/Config/menu.c
#include "oled.h"
#include "stdlib.h" 	 
#include "delay.h"
#include "menu.h"
#include "nrf24l01.h"
#include "key.h"
#include "flash.h"
#include "adc.h"
#include "delay.h"
#include "usart.h"
#include "main.h"
/*https://blog.csdn.net/embedded_guzi/article/details/35835755
https://blog.csdn.net/calmuse/article/details/79346742
*/

Key_index_struct Key_table[MENU_NUM]=
{
	//当前, 下, 上, 确定, 返回, home
  {home, home, home, tdwt, home, home,(*mainWindow)},//主页面：home
	
	{tdwt, tdzf, gybj, tdwt1, home, home,(*menu_tdwt)},//一级菜单：通道微调
	{tdzf, hksz, tdwt, tdzf1, home, home,(*menu_tdzf)},//一级菜单：通道正反
	{hksz, jsgl, tdzf, sjyhk, home, home,(*menu_hksz)},//一级菜单：混控设置
	{jsgl, scsz, hksz, xjjs, home, home,(*menu_jsgl)},//一级菜单：接收管理
	{scsz, tdys, jsgl, ppmsc, home, home,(*menu_scsz)},//一级菜单：输出设置
	{tdys, dljs, scsz, tdys1, home, home,(*menu_tdys)},//一级菜单：通道映射
	{dljs, xtsz, tdys, dljs18, home, home,(*menu_dljs)},//一级菜单：舵量监视
	{xtsz, gybj, dljs, cysz, home, home,(*menu_xtsz)},//一级菜单：系统设置
	{gybj, tdwt, xtsz, gybjInf, home, home,(*menu_gybj)},//一级菜单：关于本机
	
	{tdwt1,tdwt2,tdwt8,tdwt1,tdwt,home,(*menu_tdwt1)},//二级菜单：通道微调1
	{tdwt2,tdwt3,tdwt1,tdwt2,tdwt,home,(*menu_tdwt2)},//二级菜单：通道微调2
	{tdwt3,tdwt4,tdwt2,tdwt3,tdwt,home,(*menu_tdwt3)},//二级菜单：通道微调3
	{tdwt4,tdwt5,tdwt3,tdwt4,tdwt,home,(*menu_tdwt4)},//二级菜单：通道微调4
	{tdwt5,tdwt6,tdwt4,tdwt5,tdwt,home,(*menu_tdwt5)},//二级菜单：通道微调5
	{tdwt6,tdwt7,tdwt5,tdwt6,tdwt,home,(*menu_tdwt6)},//二级菜单：通道微调6
	{tdwt7,tdwt8,tdwt6,tdwt7,tdwt,home,(*menu_tdwt7)},//二级菜单：通道微调7
	{tdwt8,tdwt1,tdwt7,tdwt8,tdwt,home,(*menu_tdwt8)},//二级菜单：通道微调8
	
	{tdzf1,tdzf2,tdzf8,tdzf1,tdzf,home,(*menu_tdzf1)},//二级菜单：通道正反1
	{tdzf2,tdzf3,tdzf1,tdzf2,tdzf,home,(*menu_tdzf2)},//二级菜单：通道正反2
	{tdzf3,tdzf4,tdzf2,tdzf3,tdzf,home,(*menu_tdzf3)},//二级菜单：通道正反3
	{tdzf4,tdzf5,tdzf3,tdzf4,tdzf,home,(*menu_tdzf4)},//二级菜单：通道正反4
	{tdzf5,tdzf6,tdzf4,tdzf5,tdzf,home,(*menu_tdzf5)},//二级菜单：通道正反5
	{tdzf6,tdzf7,tdzf5,tdzf6,tdzf,home,(*menu_tdzf6)},//二级菜单：通道正反6
	{tdzf7,tdzf8,tdzf6,tdzf7,tdzf,home,(*menu_tdzf7)},//二级菜单：通道正反7
	{tdzf8,tdzf1,tdzf7,tdzf8,tdzf,home,(*menu_tdzf8)},//二级菜单：通道正反8
	//当前, 下, 上, 确定, 返回, home
	{sjyhk,vyhk,jfyhk,sjyhk,hksz,home,(*menu_sjyhk)},//二级菜单：三角翼混控
	{vyhk,cshk,sjyhk,vyhk,hksz,home,(*menu_vyhk)},//二级菜单：V翼混控
	{cshk,jfyhk,vyhk,cshk,hksz,home,(*menu_cshk)},//二级菜单：差速混控
	{jfyhk,sjyhk,cshk,jfyhk,hksz,home,(*menu_jfyhk)},//二级菜单：襟副翼混控
	
	{xjjs,xzmx,txmm,xjjs,jsgl,home,(*menu_xjjs)},//二级菜单：新建接收
	{xzmx,bcmx,xjjs,jsgl,jsgl,home,(*menu_xzmx)},//二级菜单：选择模型
	{bcmx,txmm,xzmx,bcmx,jsgl,home,(*menu_bcmx)},//二级菜单：保存模型
	{txmm,xjjs,bcmx,txmm,jsgl,home,(*menu_txmm)},//二级菜单：通信密码
	
	{ppmsc,wxfs,fsgl,ppmsc,scsz,home,(*menu_ppmsc)},//二级菜单：PPM输出
	{wxfs,fsgl,ppmsc,wxfs,scsz,home,(*menu_wxfs)},//二级菜单：无线发射
	{fsgl,ppmsc,wxfs,fsgl,scsz,home,(*menu_fsgl)},//二级菜单：发射功率
	
	{tdys1,tdys2,tdys8,tdys1,tdys,home,(*menu_tdys1)},//二级菜单：通道映射1
	{tdys2,tdys3,tdys1,tdys2,tdys,home,(*menu_tdys2)},//二级菜单：通道映射2
	{tdys3,tdys4,tdys2,tdys3,tdys,home,(*menu_tdys3)},//二级菜单：通道映射3
	{tdys4,tdys5,tdys3,tdys4,tdys,home,(*menu_tdys4)},//二级菜单：通道映射4
	{tdys5,tdys6,tdys4,tdys5,tdys,home,(*menu_tdys5)},//二级菜单：通道映射5
	{tdys6,tdys7,tdys5,tdys6,tdys,home,(*menu_tdys6)},//二级菜单：通道映射6
	{tdys7,tdys8,tdys6,tdys7,tdys,home,(*menu_tdys7)},//二级菜单：通道映射7
	{tdys8,tdys1,tdys7,tdys8,tdys,home,(*menu_tdys8)},//二级菜单：通道映射8
	
	{dljs18,dljs18,dljs18,dljs,dljs,home,(*menu_dljs18)},//二级菜单：舵量监视1-8
	
	{cysz,dysz,hfcc,wtdw,xtsz,home,(*menu_cysz)},//二级菜单：常用设置
	{dysz,nzsz,cysz,dyjz,xtsz,home,(*menu_dysz)},//二级菜单：电压设置
	{nzsz,ymsz,dysz,nzbj,xtsz,home,(*menu_nzsz)},//二级菜单：闹钟设置
	{ymsz,xcjz,nzsz,ymph,xtsz,home,(*menu_ymsz)},//二级菜单：油门设置
	{xcjz,hfcc,ymsz,xcjzTip,xtsz,home,(*menu_xcjz)},//二级菜单：行程校准
	{hfcc,cysz,xcjz,hfccTip,xtsz,home,(*menu_hfcc)},//二级菜单：恢复出厂设置
	
	{wtdw,ajyx,kjhm,cysz,cysz,home,(*menu_wtdw)},//三级菜单：微调单位
	{ajyx,kjhm,wtdw,cysz,cysz,home,(*menu_ajyx)},//三级菜单：按键音效
	{kjhm,wtdw,ajyx,cysz,cysz,home,(*menu_kjhm)},//三级菜单：开机画面

	{dyjz,bjdy,jsbj,dysz,dysz,home,(*menu_dyjz)},//三级菜单：电压校准
	{bjdy,jsbj,dyjz,dysz,dysz,home,(*menu_bjdy)},//三级菜单：报警电压
	{jsbj,dyjz,bjdy,dysz,dysz,home,(*menu_jsbj)},//三级菜单：接收报警

	{nzbj,nzsc,kjzj,nzsz,nzsz,home,(*menu_nzbj)},//三级菜单：闹钟报警
	{nzsc,kjzj,nzbj,nzsz,nzsz,home,(*menu_nzsc)},//三级菜单：闹钟时长
	{kjzj,nzbj,nzsc,nzsz,nzsz,home,(*menu_kjzj)},//三级菜单：开机自检
	//当前, 下, 上, 确定, 返回, home
	{ymph,ymqx,skbh,ymsz,ymsz,home,(*menu_ymph)},//三级菜单：油门偏好
	{ymqx,skbh,ymph,ymqx,ymsz,home,(*menu_ymqx)},//三级菜单：油门曲线
	{skbh,ymph,ymqx,ymsz,ymsz,home,(*menu_skbh)},//三级菜单：失控保护

	{xcjzTip,xcjzTip,xcjzTip,xcjz14,xcjz,home,(*menu_xcjzTip)},//三级菜单：行程校准提示
	{xcjz14,xcjz14,xcjz14,xcjz,xcjz,home,(*menu_xcjz14)},//三级菜单：行程校准1-4

	{hfccTip,hfccTip,hfccTip,hfcg,hfcc,home,(*menu_hfccTip)},//三级菜单：恢复出厂设置提示
	{hfcg,hfcg,hfcg,hfcc,hfcc,home,(*menu_hfcg)},//三级菜单：恢复成功

	{gybjInf,gybjInf,gybjInf,gybj,gybj,home,(*menu_gybjInf)},//三级菜单：关于本机提示

};
u16 homeGoIndex = tdwt;//home的快速跳转菜单页
u8 volatile nowMenuIndex = 0;
u8 volatile lastMenuIndex = 0;
extern unsigned char logo[];
extern unsigned char logoR[];
char batVoltStr[8];
char timeStr[9];
u8 iconTop[11] 	= {0X04,0X0C,0X18,0X30,0X60,0XC0,0X60,0X30,0X18,0X0C,0X04};
u8 iconBottom[11]	= {0X80,0XC0,0X60,0X30,0X18,0X0C,0X18,0X30,0X60,0XC0,0X80};
u8 iconHand[32] = {
	0X01,0X00,0X01,0X00,0X02,0X80,0X02,0XC0,0X04,0XBC,0X05,0X6C,0X05,0XE8,0X0B,0X90,
	0X0B,0X10,0X0E,0X08,0X1C,0X08,0X1C,0X18,0X18,0X60,0X33,0X80,0X3C,0X00,0X20,0X00,};
u8 iconOn[18] = {0X10,0X28,0X44,0X82,0XBA,0XBA,0X82,0XC6,0XAA,0X92,0X82,0X82,0X82,0X82,0X82,0X44,0X28,0X10,};
u8 iconOff[18] = {0X10,0X38,0X7C,0XFE,0XFE,0XFE,0XFE,0XFE,0XFE,0XEE,0XC6,0X82,0XBA,0XBA,0X82,0X44,0X28,0X10,};
unsigned char iconJ20[102] = {
	0XFF,0XF8,0XFF,0XF8,0XFF,0XF8,0XFF,0XF8,0XFF,0XE8,0XFF,0XE8,0XFF,0XE8,0XFF,0XE8,
	0XC0,0X08,0XC0,0X08,0XC0,0X08,0XC0,0X08,0XFF,0XF8,0XDF,0XC8,0XDF,0X88,0XDF,0X08,
	0XDE,0X08,0XDC,0X08,0XD8,0X68,0XC0,0XE8,0XC1,0XE8,0XC3,0XE8,0XC7,0XE8,0XFF,0XF8,
	0XC0,0X08,0XC0,0X08,0XC0,0X08,0XDE,0X68,0XDE,0XE8,0XDD,0XE8,0XD9,0XE8,0XC0,0X08,
	0XC0,0X08,0XC0,0X18,0XFF,0XF8,0XFF,0XF8,0XFF,0XF8,0XFF,0XF8,0XFF,0XF8,0XFF,0XF0,
	0XFF,0XE0,0XFF,0XC0,0XFF,0X80,0XFF,0X00,0XFE,0X00,0XFC,0X00,0XF8,0X00,0XF0,0X00,
	0XE0,0X00,0XC0,0X00,0X80,0X00,};
unsigned char iconSignal[22] = {
	0X00,0X70,0X00,0X70,0X00,0X00,0X03,0XF0,0X03,0XF0,
	0X00,0X00,0X1F,0XF0,0X1F,0XF0,0X00,0X00,0XFF,0XF0,0XFF,0XF0,};
unsigned char iconClock[22] = {
	0XEF,0XB0,0XDF,0XF0,0XBD,0XE0,0X7D,0XF0,0X7D,0XF0,
	0X01,0XF0,0X7F,0XF0,0X7F,0XF0,0XBF,0XE0,0XDF,0XF0,0XEF,0XB0,};
unsigned char iconSw1000[24] = {
	0X3F,0XFF,0X00,0X7F,0XF9,0X80,0XFF,0XF0,0XC0,0XFF,0XE0,0X40,0XFF,0XE0,0X40,0XFF,
	0XF0,0XC0,0X7F,0XF9,0X80,0X3F,0XFF,0X00,};
unsigned char iconSw1500[24] = {
	0X3F,0XFF,0X00,0X7F,0X3F,0X80,0XFE,0X1F,0XC0,0XFC,0X0F,0XC0,0XFC,0X0F,0XC0,0XFE,
	0X1F,0XC0,0X7F,0X3F,0X80,0X3F,0XFF,0X00,};
unsigned char iconSw2000[24] = {
	0X3F,0XFF,0X00,0X67,0XFF,0X80,0XC3,0XFF,0XC0,0X81,0XFF,0XC0,0X81,0XFF,0XC0,0XC3,
	0XFF,0XC0,0X67,0XFF,0X80,0X3F,0XFF,0X00,};
unsigned char iconPlane[96] = {
	0X00,0X10,0X00,0X30,0X00,0X30,0X00,0X38,0X00,0X78,0X00,0X78,0X00,0X78,0X00,0XFC,
	0X00,0XFF,0X01,0XFC,0X01,0XFC,0X03,0X7C,0X03,0X7C,0X02,0X7C,0X02,0X7C,0X02,0X7C,
	0X02,0XFC,0X02,0XFC,0X02,0XFC,0X03,0XFC,0X03,0XFE,0X03,0XFE,0X01,0XFE,0X01,0XFE,
	0X01,0XFE,0X01,0XFE,0X01,0XFF,0X00,0XFF,0X00,0XFC,0X00,0XFC,0X00,0XFC,0X00,0XF8,
	0X00,0XF8,0X00,0XF8,0X01,0XF8,0X01,0XF8,0X03,0XF8,0X07,0XF0,0X0F,0XF0,0X1F,0XF0,
	0X3F,0XF0,0X7F,0XE0,0XFF,0XE0,0XFE,0XE0,0XFC,0XC0,0XF0,0X00,0XC0,0X00,0X80,0X00,
	};
unsigned char iconCar[96] = {
	0X00,0X00,0X00,0X08,0X00,0XE8,0X01,0XF8,0X01,0XF8,0X03,0XF8,0X03,0X80,0X07,0X38,
	0X06,0X7C,0X0E,0XFE,0X0E,0XFE,0X0E,0XFE,0X0E,0X7C,0X0F,0X38,0X0F,0X80,0X0F,0XF8,
	0X0F,0XF8,0X0F,0XF8,0X1F,0XF8,0X1F,0XF8,0X1F,0XF8,0X17,0XF8,0X37,0XF8,0X27,0XF8,
	0X67,0XF8,0X47,0XF8,0X47,0XF8,0X47,0XF8,0X47,0XF8,0X47,0XF8,0X4F,0XF8,0X4F,0XF8,
	0X4F,0XF8,0X6F,0X80,0X6F,0X38,0X3E,0X7C,0X3E,0XFE,0X3E,0XFE,0X1E,0XFE,0X1E,0X7C,
	0X3F,0X38,0X7F,0X80,0X7F,0XE0,0X6F,0XC0,0X6F,0X80,0X40,0X00,0X40,0X00,0X00,0X00,
	};
unsigned char iconBoat[96] = {
	0X00,0X00,0X01,0X00,0X01,0X80,0X01,0XC0,0X01,0XC0,0X01,0XE0,0X01,0XE0,0X01,0XF0,
	0X01,0XF0,0X01,0XF0,0X01,0XF0,0X01,0XF8,0X01,0XF8,0X01,0XF8,0X01,0XF8,0X01,0XFC,
	0X01,0XFC,0X01,0XFC,0X01,0XFC,0X01,0XFC,0X01,0XFC,0X03,0XFC,0X03,0XFC,0X03,0XFC,
	0X03,0XFC,0X07,0XFC,0X07,0XFC,0X07,0XFC,0X0F,0XFC,0X1F,0XFC,0X01,0XFC,0X01,0XFC,
	0X03,0XFC,0X07,0XFC,0X01,0XFC,0X07,0XFC,0X07,0XFC,0X07,0XFC,0X07,0XFC,0X07,0XF4,
	0X07,0XFE,0X07,0XF4,0X07,0XF0,0X01,0XFE,0X01,0XFE,0X01,0XF0,0X00,0X00,0X00,0X00,
	};
unsigned char clockFill[86] = {
0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X10,0X80,0X00,0X00,
0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X10,0X80,0X00,0X00,0X00,0X00,
0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
0X00,0X00,0X00,0X00,0X00,0X00,};
unsigned char leftFill[42] = {
0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X80,0X00,0X00,0X00,0X00,0X00,
0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X80,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
0X00,0X00,0X00,0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,0X80,};

void main2menuList(u8 hz1,u8 hz2,u8 hz3,u8 hz4);
void menuList2tdwt(void);
void menuList2tdzf(void);
void menuList2tdys(void);

void OLED_display(void){
	switch(menuEvent[1]){
		case BM_down: //逆时针旋转，向下
			nowMenuIndex=Key_table[nowMenuIndex].down_index;
			break;
		case BM_up: //顺时针旋转,向上
			nowMenuIndex=Key_table[nowMenuIndex].up_index;
			break;
		case KEY_enter://确定
			nowMenuIndex=Key_table[nowMenuIndex].enter_index;
			break;
		case KEY_esc://返回
			nowMenuIndex=Key_table[nowMenuIndex].esc_index;
			break;
		case KEY_home://长按 返回主界面
			nowMenuIndex=Key_table[nowMenuIndex].home_index;
			break;
		case NUM_down:
			break;
		case NUM_up:
			break;
	}
	if(nowMenuIndex==home && lastMenuIndex!=home) 
	{
		if(lastMenuIndex!=xcjz14) homeGoIndex = lastMenuIndex;
		else homeGoIndex = xcjz;
		OLED_Fill(0,0,127,63,0);//清空
	}
	if(nowMenuIndex!=home && lastMenuIndex==home) {nowMenuIndex = homeGoIndex;OLED_Fill(0,0,127,63,0);}//清空，实现快速跳转
	if(nowMenuIndex>=tdwt && nowMenuIndex<=gybj && (lastMenuIndex<tdwt | lastMenuIndex>gybj)) main2menuList(sheZhi,zhi,cai,dan);//切换窗口
	if(nowMenuIndex>=tdwt1 && nowMenuIndex<=tdwt8 && (lastMenuIndex<tdwt1 | lastMenuIndex>tdwt8))menuList2tdwt();//切换窗口
	if(nowMenuIndex>=tdzf1 && nowMenuIndex<=tdzf8 && (lastMenuIndex<tdzf1 | lastMenuIndex>tdzf8))menuList2tdzf();//切换窗口
	if(nowMenuIndex>=sjyhk && nowMenuIndex<=jfyhk && (lastMenuIndex<sjyhk | lastMenuIndex>jfyhk))OLED_Fill(0,0,127,63,0);//清空
	if(nowMenuIndex>=xjjs && nowMenuIndex<=txmm && (lastMenuIndex<xjjs | lastMenuIndex>txmm))OLED_Fill(0,0,127,63,0);//清空
	if(nowMenuIndex>=ppmsc && nowMenuIndex<=fsgl && (lastMenuIndex<ppmsc | lastMenuIndex>fsgl))OLED_Fill(0,0,127,63,0);//清空
	if(nowMenuIndex>=tdys1 && nowMenuIndex<=tdys8 && (lastMenuIndex<tdys1 | lastMenuIndex>tdys8))menuList2tdys();//切换窗口
	if(nowMenuIndex==dljs18 && lastMenuIndex!=dljs18) OLED_Fill(0,0,127,63,0);//清空
	if(nowMenuIndex>=cysz && nowMenuIndex<=hfcc && (lastMenuIndex<cysz | lastMenuIndex>hfcc)) main2menuList(xi,tongYi,sheZhi,zhi);//切换窗口
	if(nowMenuIndex>=wtdw && nowMenuIndex<=kjhm && (lastMenuIndex<wtdw | lastMenuIndex>kjhm))OLED_Fill(0,0,127,63,0);//清空
	if(nowMenuIndex>=dyjz && nowMenuIndex<=jsbj && (lastMenuIndex<dyjz | lastMenuIndex>jsbj))OLED_Fill(0,0,127,63,0);//清空
	if(nowMenuIndex>=nzbj && nowMenuIndex<=kjzj && (lastMenuIndex<nzbj | lastMenuIndex>kjzj))OLED_Fill(0,0,127,63,0);//清空
	if(nowMenuIndex>=ymph && nowMenuIndex<=skbh && (lastMenuIndex<ymph | lastMenuIndex>skbh))OLED_Fill(0,0,127,63,0);//清空
	if(nowMenuIndex==xcjz14 && lastMenuIndex!=xcjz14) OLED_Fill(0,0,127,63,0);//清空
//	printf("key:%d, last:%d, now:%d\r\n",menuEvent[1],lastMenuIndex,nowMenuIndex);
	if(nowMenuIndex!=lastMenuIndex)
	{
		Key_table[nowMenuIndex].operate();
		OLED_Refresh_Gram();//刷新显存
	}
}

