J20RC/STM32_RC_Transmitter/software/Config/menu.c
void showSwState(void)
{
	u8 i=0;
	for(i=0;i<4;i++)//四个辅助通道显示
	{
		if(PWMvalue[4+i]<1250) OLED_DrawPointBMP(14+12*i,18,iconSw1000,11,18,1);
		else if(PWMvalue[4+i]<1750) OLED_DrawPointBMP(14+12*i,18,iconSw1500,11,18,1);
		else OLED_DrawPointBMP(14+12*i,18,iconSw2000,11,18,1);
	}
}

void mainWindow(void)
{
	u16 thrNum;
	int loca;
	
	OLED_DrawPointBMP(0,0,iconJ20,54,15,1);//J20图标
	OLED_DrawPointBMP(51,1,iconSignal,15,12,1);//信号图标
	OLED_DrawPointBMP(68,1,iconClock,15,12,1);//闹钟图标

	OLED_DrawPointBMP(85,1,clockFill,43,12,0);//背景填充
	drawClockTime();//时间显示00:00:00
	
	showSwState();//显示后4个通道的状态
	if(setData.modelType==0) OLED_DrawPointBMP(11,39,iconPlane,48,16,1);//模型图标
	else if(setData.modelType==1) OLED_DrawPointBMP(11,39,iconCar,48,16,1);//模型图标
	else OLED_DrawPointBMP(11,39,iconBoat,48,16,1);//模型图标
	
	OLED_ShowString(70,19, (u8 *)"T",16,1);//遥控器
	sprintf((char *)batVoltStr,"%1.2fV",batVolt);
	OLED_ShowString(80,19, (u8 *)batVoltStr,16,1);//显示电池电压
	
	OLED_ShowString(70,38, (u8 *)"R",16,1);//接收机
	OLED_ShowString(80,38, (u8 *)"12.6V",16,1);//显示电池电压
	
	OLED_DrawPointBMP(0,15,leftFill,6,49,0);//背景填充
	OLED_DrawPointBMP(123,15,leftFill,6,49,0);//背景填充
	OLED_Fill(7,59,62,63,1);//底侧左框-4
	OLED_Fill(65,59,120,63,1);//底侧右框-1
	
	if(setData.throttlePreference)//左手油门
	{
		OLED_DrawPoint(35,60,0);//中心标识-4
		OLED_DrawPoint(35,62,0);//中心标识-4
		OLED_DrawPoint(93,60,0);//中心标识-1
		OLED_DrawPoint(93,62,0);//中心标识-1
		//第1通道微调标识-横滚-右横线
		OLED_Fill(66,61,119,61,1);//写1，清除原来的标志
		loca = (int)93+setData.PWMadjustValue[0]/12.5;
		OLED_Fill(loca-2,61,loca+2,61,0);//写0
		
		//第2通道微调标识-升降舵-右竖线
		OLED_Fill(125,16,125,62,1);//写1
		loca = (int)39-setData.PWMadjustValue[1]/14.29;
		OLED_Fill(125,loca-2,125,loca+2,0);//写1
		
		//第3通道油门行程线-左竖线
		thrNum = (int)(PWMvalue[2]-1000)/22;
		OLED_Fill(2,62-thrNum,2,62,0);//下部分写1
		OLED_Fill(2,16,2,62-thrNum,1);//上部分写0
		
		//第4通道微调标识-方向舵-左横线
		OLED_Fill(7,61,61,61,1);//写1，清除原来的标志
		loca = (int)35+setData.PWMadjustValue[3]/12.5;
		OLED_Fill(loca-2,61,loca+2,61,0);//写0
	}
	else{//右手油门
		OLED_DrawPoint(34,60,0);//中心标识-4
		OLED_DrawPoint(34,62,0);//中心标识-4
		OLED_DrawPoint(93,60,0);//中心标识-1
		OLED_DrawPoint(93,62,0);//中心标识-1
		//第1通道微调标识-横滚-左横线
		OLED_Fill(7,61,61,61,1);//写1，清除原来的标志
		loca = (int)34+setData.PWMadjustValue[0]/12.5;
		OLED_Fill(loca-2,61,loca+2,61,0);//写0
		
		//第2通道微调标识-升降舵-左竖线
		OLED_Fill(2,16,2,62,1);//写1
		loca = (int)39-setData.PWMadjustValue[1]/14.29;
		OLED_Fill(2,loca-2,2,loca+2,0);//写1
		
		//第3通道油门行程线-右竖线
		thrNum = (int)(PWMvalue[2]-1000)/22;
		OLED_Fill(125,62-thrNum,125,62,0);//下部分写1
		OLED_Fill(125,16,125,62-thrNum,1);//上部分写0
		
		//第4通道微调标识-方向舵-右横线
		OLED_Fill(66,61,119,61,1);//写1，清除原来的标志
		loca = (int)93+setData.PWMadjustValue[3]/12.5;
		OLED_Fill(loca-2,61,loca+2,61,0);//写0
	}
}
//主窗口-一级菜单 切换
void main2menuList(u8 hz1,u8 hz2,u8 hz3,u8 hz4)
{
	OLED_Fill(0,0,127,15,1);//顶部填充
	OLED_Fill(0,16,127,63,0);//清空下半部分
	//顶部菜单栏：设置菜单
	u8 szcdIndex[]={hz1,hz2,hz3,hz4};
	OLED_ShowChineseWords(32,0,szcdIndex,4,0);
	//侧边栏
	OLED_Fill(115,16,115,63,1);//侧边栏左竖线填充
	OLED_Fill(127,16,127,63,1);//侧边栏右竖线填充
	OLED_DrawPointBMP(116,16,iconTop,15,6,1);//侧边栏上箭头
	OLED_DrawPointBMP(116,58,iconBottom,15,6,1);//侧边栏下箭头
}
/*
listIndex：侧边栏滑块定位,1~8
mode：三行的显示模式
str1~3：三行中的字符串
hzIndex：三行中的12个汉字在数组中的索引
*/
void menuListWindow(u8 listIndex,u8 mode[],u8 *str1,u8 *str2,u8 *str3,u8 hzIndex[],u8 len)
{	
	//箭头
	OLED_Fill(0,16,16,63,0);//箭头清空
	OLED_DrawPointBMP(0,16+16*((listIndex-1)%3),iconHand,16,16,1);//指示箭头
	//第一行
	OLED_ShowString(16,16,str1,16,mode[0]);
	u8 line1Index[]={hzIndex[0],hzIndex[1],hzIndex[2],hzIndex[3]};
	OLED_ShowChineseWords(32,16,line1Index,4,mode[0]);
	//第二行
	OLED_ShowString(16,32,str2,16,mode[1]);
	u8 line2Index[]={hzIndex[4],hzIndex[5],hzIndex[6],hzIndex[7]};
	OLED_ShowChineseWords(32,32,line2Index,4,mode[1]);
	//第三行
	OLED_ShowString(16,48,str3,16,mode[2]);
	u8 line3Index[]={hzIndex[8],hzIndex[9],hzIndex[10],hzIndex[11]};
	OLED_ShowChineseWords(32,48,line3Index,4,mode[2]);
	//侧边栏
	OLED_Fill(116,22,126,57,0);//侧边栏清空
	OLED_Fill(116,(u8)19+32*listIndex/len,126,(u8)24+32*listIndex/len,1);//侧边栏滑块填充
}
void menu_tdwt(void){
	u8 modes[3]={0,1,1};
	u8 str1[]="1.";
	u8 str2[]="2.";
	u8 str3[]="3.";
	u8 hzIndex[12]={tongDao,dao,weiTiao,tiao, tongDao,dao,zheng,fan, hun,kong,sheZhi,zhi};
	menuListWindow(1,modes,str1,str2,str3,hzIndex,9);
}//一级菜单：1.通道微调

void menu_tdzf(void){
	u8 modes[3]={1,0,1};
	u8 str1[]="1.";
	u8 str2[]="2.";
	u8 str3[]="3.";
	u8 hzIndex[12]={tongDao,dao,weiTiao,tiao, tongDao,dao,zheng,fan, hun,kong,sheZhi,zhi};
	menuListWindow(2,modes,str1,str2,str3,hzIndex,9);
}//一级菜单：2.通道正反
void menu_hksz(void){
	u8 modes[3]={1,1,0};
	u8 str1[]="1.";
	u8 str2[]="2.";
	u8 str3[]="3.";
	u8 hzIndex[12]={tongDao,dao,weiTiao,tiao, tongDao,dao,zheng,fan, hun,kong,sheZhi,zhi};
	menuListWindow(3,modes,str1,str2,str3,hzIndex,9);
}//一级菜单：3.混控设置
void menu_jsgl(void){
	u8 modes[3]={0,1,1};
	u8 str1[]="4.";
	u8 str2[]="5.";
	u8 str3[]="6.";
	u8 hzIndex[12]={jie,shouDao,guanLi,li,shu,chu,sheZhi,zhi,tongDao,dao,ying,sheMen};
	menuListWindow(4,modes,str1,str2,str3,hzIndex,9);
}//一级菜单：4.接收管理
void menu_scsz(void){
	u8 modes[3]={1,0,1};
	u8 str1[]="4.";
	u8 str2[]="5.";
	u8 str3[]="6.";
	u8 hzIndex[12]={jie,shouDao,guanLi,li,shu,chu,sheZhi,zhi,tongDao,dao,ying,sheMen};
	menuListWindow(5,modes,str1,str2,str3,hzIndex,9);
}//一级菜单：5.输出设置
void menu_tdys(void){
	u8 modes[3]={1,1,0};
	u8 str1[]="4.";
	u8 str2[]="5.";
	u8 str3[]="6.";
	u8 hzIndex[12]={jie,shouDao,guanLi,li,shu,chu,sheZhi,zhi,tongDao,dao,ying,sheMen};
	menuListWindow(6,modes,str1,str2,str3,hzIndex,9);
}//一级菜单：6.通道映射
void menu_dljs(void){
	u8 modes[3]={0,1,1};
	u8 str1[]="7.";
	u8 str2[]="8.";
	u8 str3[]="9.";
	u8 hzIndex[12]={duo,liang,jianShi,shiYe,xi,tongYi,sheZhi,zhi,guanMen,yu,ben,jiQi};
	menuListWindow(7,modes,str1,str2,str3,hzIndex,9);
}//一级菜单：7.舵量监视
void menu_xtsz(void){
	u8 modes[3]={1,0,1};
	u8 str1[]="7.";
	u8 str2[]="8.";
	u8 str3[]="9.";
	u8 hzIndex[12]={duo,liang,jianShi,shiYe,xi,tongYi,sheZhi,zhi,guanMen,yu,ben,jiQi};
	menuListWindow(8,modes,str1,str2,str3,hzIndex,9);
}//一级菜单：8.系统设置
void menu_gybj(void){
	u8 modes[3]={1,1,0};
	u8 str1[]="7.";
	u8 str2[]="8.";
	u8 str3[]="9.";
	u8 hzIndex[12]={duo,liang,jianShi,shiYe,xi,tongYi,sheZhi,zhi,guanMen,yu,ben,jiQi};
	menuListWindow(9,modes,str1,str2,str3,hzIndex,9);
}//一级菜单：9.关于本机

