J20RC/STM32_RC_Transmitter/software/Config/menu.c
//一级菜单-二级菜单 通道微调窗口 切换
void menuList2tdwt(void)
{
	OLED_Fill(0,0,127,63,0);//清空
	OLED_Fill(63,0,64,63,1);//中间竖线
}
/*mode[]：各个CH的显示模式数组*/
void tdwtWindow(u8 mode[])
{
	OLED_ShowString(1,0, (u8 *)"CH1",16,mode[0]);
	OLED_ShowNum(30,0,abs(setData.PWMadjustValue[0]),3,16);
	if(setData.PWMadjustValue[0]<0) OLED_ShowString(54,0, (u8 *)"-",16,1);
	else OLED_ShowString(54,0, (u8 *)"+",16,1);
	
	OLED_ShowString(1,16, (u8 *)"CH2",16,mode[1]);
	OLED_ShowNum(30,16,abs(setData.PWMadjustValue[1]),3,16);
	if(setData.PWMadjustValue[1]<0) OLED_ShowString(54,16, (u8 *)"-",16,1);
	else OLED_ShowString(54,16, (u8 *)"+",16,1);
	
	OLED_ShowString(1,32, (u8 *)"CH3",16,mode[2]);
	OLED_ShowNum(30,32,abs(setData.PWMadjustValue[2]),3,16);
	if(setData.PWMadjustValue[2]<0) OLED_ShowString(54,32, (u8 *)"-",16,1);
	else OLED_ShowString(54,32, (u8 *)"+",16,1);
	
	OLED_ShowString(1,48, (u8 *)"CH4",16,mode[3]);
	OLED_ShowNum(30,48,abs(setData.PWMadjustValue[3]),3,16);
	if(setData.PWMadjustValue[3]<0) OLED_ShowString(54,48, (u8 *)"-",16,1);
	else OLED_ShowString(54,48, (u8 *)"+",16,1);
	
	OLED_ShowString(66,0, (u8 *)"CH5",16,mode[4]);
	OLED_ShowNum(95,0,abs(setData.PWMadjustValue[4]),3,16);
	if(setData.PWMadjustValue[4]<0) OLED_ShowString(119,0, (u8 *)"-",16,1);
	else OLED_ShowString(119,0, (u8 *)"+",16,1);
	
	OLED_ShowString(66,16, (u8 *)"CH6",16,mode[5]);
	OLED_ShowNum(95,16,abs(setData.PWMadjustValue[5]),3,16);
	if(setData.PWMadjustValue[5]<0) OLED_ShowString(119,16, (u8 *)"-",16,1);
	else OLED_ShowString(119,16, (u8 *)"+",16,1);
	
	OLED_ShowString(66,32, (u8 *)"CH7",16,mode[6]);
	OLED_ShowNum(95,32,abs(setData.PWMadjustValue[6]),3,16);
	if(setData.PWMadjustValue[6]<0) OLED_ShowString(119,32, (u8 *)"-",16,1);
	else OLED_ShowString(119,32, (u8 *)"+",16,1);
	
	OLED_ShowString(66,48, (u8 *)"CH8",16,mode[7]);
	OLED_ShowNum(95,48,abs(setData.PWMadjustValue[7]),3,16);
	if(setData.PWMadjustValue[7]<0) OLED_ShowString(119,48, (u8 *)"-",16,1);
	else OLED_ShowString(119,48, (u8 *)"+",16,1);
}
void menu_tdwt1(void){
	u8 modes[8]={0,1,1,1,1,1,1,1};
	tdwtWindow(modes);
}//二级菜单：通道1
void menu_tdwt2(void){
	u8 modes[8]={1,0,1,1,1,1,1,1};
	tdwtWindow(modes);
}//二级菜单：通道2
void menu_tdwt3(void){
	u8 modes[8]={1,1,0,1,1,1,1,1};
	tdwtWindow(modes);
}//二级菜单：通道3
void menu_tdwt4(void){
	u8 modes[8]={1,1,1,0,1,1,1,1};
	tdwtWindow(modes);
}//二级菜单：通道4
void menu_tdwt5(void){
	u8 modes[8]={1,1,1,1,0,1,1,1};
	tdwtWindow(modes);
}//二级菜单：通道5
void menu_tdwt6(void){
	u8 modes[8]={1,1,1,1,1,0,1,1};
	tdwtWindow(modes);
}//二级菜单：通道6
void menu_tdwt7(void){
	u8 modes[8]={1,1,1,1,1,1,0,1};
	tdwtWindow(modes);
}//二级菜单：通道7
void menu_tdwt8(void){
	u8 modes[8]={1,1,1,1,1,1,1,0};
	tdwtWindow(modes);
}//二级菜单：通道8

//一级菜单-二级菜单 通道微调窗口 切换
void menuList2tdzf(void)
{
	OLED_Fill(0,0,127,63,0);//清空
	OLED_Fill(63,0,64,63,1);//中间竖线
}
/*mode[]：各个CH的显示模式数组*/
void tdzfWindow(u8 mode[])
{
	OLED_ShowString(1,0, (u8 *)"CH1",16,mode[0]);
	if(setData.chReverse[0])OLED_DrawPointBMP(30,4,iconOn,21,7,1);//正
	else OLED_DrawPointBMP(30,4,iconOff,21,7,1);//反
	
	OLED_ShowString(1,16, (u8 *)"CH2",16,mode[1]);
	if(setData.chReverse[1])OLED_DrawPointBMP(30,20,iconOn,21,7,1);//正
	else OLED_DrawPointBMP(30,20,iconOff,21,7,1);//反
	
	OLED_ShowString(1,32, (u8 *)"CH3",16,mode[2]);
	if(setData.chReverse[2])OLED_DrawPointBMP(30,36,iconOn,21,7,1);//正
	else OLED_DrawPointBMP(30,36,iconOff,21,7,1);//反
	
	OLED_ShowString(1,48, (u8 *)"CH4",16,mode[3]);
	if(setData.chReverse[3])OLED_DrawPointBMP(30,52,iconOn,21,7,1);//正
	else OLED_DrawPointBMP(30,52,iconOff,21,7,1);//反
	
	OLED_ShowString(66,0, (u8 *)"CH5",16,mode[4]);
	if(setData.chReverse[4])OLED_DrawPointBMP(94,4,iconOn,21,7,1);//正
	else OLED_DrawPointBMP(94,4,iconOff,21,7,1);//反
	
	OLED_ShowString(66,16, (u8 *)"CH6",16,mode[5]);
	if(setData.chReverse[5])OLED_DrawPointBMP(94,20,iconOn,21,7,1);//正
	else OLED_DrawPointBMP(94,20,iconOff,21,7,1);//反
	
	OLED_ShowString(66,32, (u8 *)"CH7",16,mode[6]);
	if(setData.chReverse[6])OLED_DrawPointBMP(94,36,iconOn,21,7,1);//正
	else OLED_DrawPointBMP(94,36,iconOff,21,7,1);//反
	
	OLED_ShowString(66,48, (u8 *)"CH8",16,mode[7]);
	if(setData.chReverse[7])OLED_DrawPointBMP(94,52,iconOn,21,7,1);//正
	else OLED_DrawPointBMP(94,52,iconOff,21,7,1);//反
}
void menu_tdzf1(void){
	u8 modes[8]={0,1,1,1,1,1,1,1};
	tdzfWindow(modes);
}//二级菜单：通道1
void menu_tdzf2(void){
	u8 modes[8]={1,0,1,1,1,1,1,1};
	tdzfWindow(modes);
}//二级菜单：通道2
void menu_tdzf3(void){
	u8 modes[8]={1,1,0,1,1,1,1,1};
	tdzfWindow(modes);
}//二级菜单：通道3
void menu_tdzf4(void){
	u8 modes[8]={1,1,1,0,1,1,1,1};
	tdzfWindow(modes);
}//二级菜单：通道4
void menu_tdzf5(void){
	u8 modes[8]={1,1,1,1,0,1,1,1};
	tdzfWindow(modes);
}//二级菜单：通道5
void menu_tdzf6(void){
	u8 modes[8]={1,1,1,1,1,0,1,1};
	tdzfWindow(modes);
}//二级菜单：通道6
void menu_tdzf7(void){
	u8 modes[8]={1,1,1,1,1,1,0,1};
	tdzfWindow(modes);
}//二级菜单：通道7
void menu_tdzf8(void){
	u8 modes[8]={1,1,1,1,1,1,1,0};
	tdzfWindow(modes);
}//二级菜单：通道8
/*
listIndex：0-3
mode：四行的显示模式
*/
void hkszWindow(u8 listIndex,u8 mode[])
{
	//箭头
	OLED_Fill(0,0,16,63,0);//箭头清空
	OLED_DrawPointBMP(0,16*listIndex,iconHand,16,16,1);//指示箭头
	//第一行
	OLED_ShowString(16,0,(u8 *)"1.",16,mode[0]);
	u8 line1Index[]={san,jiaoDu,yi,hun,kong};
	OLED_ShowChineseWords(32,0,line1Index,5,mode[0]);
	//第二行
	OLED_ShowString(16,16,(u8 *)"2.",16,mode[1]);
	OLED_ShowString(32,16,(u8 *)"V ",16,mode[1]);
	u8 line2Index[]={yi,hun,kong};
	OLED_ShowChineseWords(48,16,line2Index,3,mode[1]);
	//第三行
	OLED_ShowString(16,32,(u8 *)"3.",16,mode[2]);
	u8 line3Index[]={cha,su,hun,kong};
	OLED_ShowChineseWords(32,32,line3Index,4,mode[2]);
	//第四行
	OLED_ShowString(16,48,(u8 *)"4.",16,mode[3]);
	u8 line4Index[]={jin,fuYi,yi,hun,kong};
	OLED_ShowChineseWords(32,48,line4Index,5,mode[3]);
}
void menu_sjyhk(void){
	u8 modes[4]={0,1,1,1};
	hkszWindow(0,modes);
}//二级菜单：三角翼混控
void menu_vyhk(void){
	u8 modes[4]={1,0,1,1};
	hkszWindow(1,modes);
}//二级菜单：V翼混控
void menu_cshk(void){
	u8 modes[4]={1,1,0,1};
	hkszWindow(2,modes);
}//二级菜单：差速混控
void menu_jfyhk(void){
	u8 modes[4]={1,1,1,0};
	hkszWindow(3,modes);
}//二级菜单：襟副翼混控
/*
listIndex：0-3
mode：四行的显示模式
*/
void jsglWindow(u8 listIndex,u8 mode[])
{
	//第一行
	OLED_ShowString(0,0,(u8 *)"1.",16,mode[0]);
	u8 line1Index[]={xinJian,jianShe,jie,shouDao};
	OLED_ShowChineseWords(16,0,line1Index,4,mode[0]);
	//第二行
	OLED_ShowString(0,16,(u8 *)"2.",16,mode[1]);
	u8 line2Index[]={xuan,ze,moXing,xingHao};
	OLED_ShowChineseWords(16,16,line2Index,4,mode[1]);
	if(setData.modelType==0)OLED_ShowChinese(88,16,yi,16,1);
	else if(setData.modelType==1)OLED_ShowChinese(88,16,che,16,1);
	else OLED_ShowChinese(88,16,chuanBoat,16,1);
	//第三行
	OLED_ShowString(0,32,(u8 *)"3.",16,mode[2]);
	u8 line3Index[]={baoCun,cun,moXing,xingHao};
	OLED_ShowChineseWords(16,32,line3Index,4,mode[2]);
	//第四行
	OLED_ShowString(0,48,(u8 *)"4.",16,mode[3]);
	u8 line4Index[]={tongDao,xinXin,mi,ma};
	OLED_ShowChineseWords(16,48,line4Index,4,mode[3]);
}
void menu_xjjs(void){
	u8 modes[4]={0,1,1,1};
	jsglWindow(0,modes);
}//二级菜单：新建接收
void menu_xzmx(void){
	u8 modes[4]={1,0,1,1};
	jsglWindow(1,modes);
}//二级菜单：选择模型
void menu_bcmx(void){
	u8 modes[4]={1,1,0,1};
	jsglWindow(2,modes);
}//二级菜单：保存模型
void menu_txmm(void){
	u8 modes[4]={1,1,1,0};
	jsglWindow(3,modes);
}//二级菜单：通信密码
/*
输出设置
listIndex：0-3
mode：四行的显示模式
*/
void scszWindow(u8 listIndex,u8 mode[])
{
	//第一行
	OLED_Fill(0,0,31,15,1);//顶部填充
	u8 line1Index[]={shu,chu,sheZhi,zhi};
	OLED_ShowChineseWords(32,0,line1Index,4,0);
	OLED_Fill(96,0,127,15,1);//顶部填充
	//第二行
	OLED_ShowString(0,16,(u8 *)"1.PPM",16,mode[0]);
	u8 line2Index[]={shu,chu};
	OLED_ShowChineseWords(40,16,line2Index,2,mode[0]);
	//第三行
	OLED_ShowString(0,32,(u8 *)"2.",16,mode[1]);
	u8 line3Index[]={wu,xian,fa,sheMen};
	OLED_ShowChineseWords(16,32,line3Index,4,mode[1]);
	//第四行
	OLED_ShowString(0,48,(u8 *)"3.",16,mode[2]);
	u8 line4Index[]={fa,sheMen,gong,lv};
	OLED_ShowChineseWords(16,48,line4Index,4,mode[2]);
}
void menu_ppmsc(void){
	u8 modes[3]={0,1,1};
	scszWindow(0,modes);
}//二级菜单：PPM输出
void menu_wxfs(void){
	u8 modes[3]={1,0,1};
	scszWindow(1,modes);
}//二级菜单：无线发射
void menu_fsgl(void){
	u8 modes[3]={1,1,0};
	scszWindow(2,modes);
}//二级菜单：发射功率

//一级菜单-二级菜单 通道映射窗口 切换
void menuList2tdys(void)
{
	OLED_Fill(0,0,127,63,0);//清空
	OLED_Fill(63,0,64,63,1);//中间竖线
}

/*mode[]：各个CH的显示模式数组*/
void tdysWindow(u8 mode[])
{
	OLED_ShowString(1,0, (u8 *)"CH1",16,mode[0]);
	OLED_ShowString(40,0, (u8 *)"Y1",16,1);//此处应读取setData,作if判断显示
	
	OLED_ShowString(1,16, (u8 *)"CH2",16,mode[1]);
	OLED_ShowString(40,16, (u8 *)"Y2",16,1);
	
	OLED_ShowString(1,32, (u8 *)"CH3",16,mode[2]);
	OLED_ShowString(40,32, (u8 *)"Y3",16,1);
	
	OLED_ShowString(1,48, (u8 *)"CH4",16,mode[3]);
	OLED_ShowString(40,48, (u8 *)"Y4",16,1);
	
	OLED_ShowString(66,0, (u8 *)"CH5",16,mode[4]);
	OLED_ShowString(105,0, (u8 *)"K1",16,1);
	
