J20RC/STM32_RC_Transmitter/software/Config/menu.c
	OLED_ShowString(66,16, (u8 *)"CH6",16,mode[5]);
	OLED_ShowString(105,16, (u8 *)"K2",16,1);
	
	OLED_ShowString(66,32, (u8 *)"CH7",16,mode[6]);
	OLED_ShowString(105,32, (u8 *)"K3",16,1);
	
	OLED_ShowString(66,48, (u8 *)"CH8",16,mode[7]);
	OLED_ShowString(105,48, (u8 *)"K4",16,1);
}
void menu_tdys1(void){
	u8 modes[8]={0,1,1,1,1,1,1,1};
	tdysWindow(modes);
}//二级菜单：通道1
void menu_tdys2(void){
	u8 modes[8]={1,0,1,1,1,1,1,1};
	tdysWindow(modes);
}//二级菜单：通道2
void menu_tdys3(void){
	u8 modes[8]={1,1,0,1,1,1,1,1};
	tdysWindow(modes);
}//二级菜单：通道3
void menu_tdys4(void){
	u8 modes[8]={1,1,1,0,1,1,1,1};
	tdysWindow(modes);
}//二级菜单：通道4
void menu_tdys5(void){
	u8 modes[8]={1,1,1,1,0,1,1,1};
	tdysWindow(modes);
}//二级菜单：通道5
void menu_tdys6(void){
	u8 modes[8]={1,1,1,1,1,0,1,1};
	tdysWindow(modes);
}//二级菜单：通道6
void menu_tdys7(void){
	u8 modes[8]={1,1,1,1,1,1,0,1};
	tdysWindow(modes);
}//二级菜单：通道7
void menu_tdys8(void){
	u8 modes[8]={1,1,1,1,1,1,1,0};
	tdysWindow(modes);
}//二级菜单：通道8
u8 chLineLen[8];
void menu_dljs18(void){
	u8 num,temp;
	for(num=0;num<8;num++)
	{
		temp = map(PWMvalue[num],1000+setData.PWMadjustValue[num],2000+setData.PWMadjustValue[num],0,63);
		if(nowMenuIndex!=lastMenuIndex|chLineLen[num]!=temp){
			OLED_Fill(16*num+4,63-temp,16*num+12,63,1);//下部分写1
			OLED_Fill(16*num+4,0,16*num+12,63-temp,0);//上部分写0
			chLineLen[num]=temp;
		}
	}
}//二级菜单：通道1-8舵量监视

void menu_cysz(void){
	u8 modes[3]={0,1,1};
	u8 str1[]="1.";
	u8 str2[]="2.";
	u8 str3[]="3.";
	u8 hzIndex[12]={changYong,yong,sheZhi,zhi,dian,ya,sheZhi,zhi,nao,zhongDian,sheZhi,zhi};
	menuListWindow(1,modes,str1,str2,str3,hzIndex,6);
}//二级菜单：常用设置
void menu_dysz(void){
	u8 modes[3]={1,0,1};
	u8 str1[]="1.";
	u8 str2[]="2.";
	u8 str3[]="3.";
	u8 hzIndex[12]={changYong,yong,sheZhi,zhi,dian,ya,sheZhi,zhi,nao,zhongDian,sheZhi,zhi};
	menuListWindow(2,modes,str1,str2,str3,hzIndex,6);
}//二级菜单：电压设置
void menu_nzsz(void){
	u8 modes[3]={1,1,0};
	u8 str1[]="1.";
	u8 str2[]="2.";
	u8 str3[]="3.";
	u8 hzIndex[12]={changYong,yong,sheZhi,zhi,dian,ya,sheZhi,zhi,nao,zhongDian,sheZhi,zhi};
	menuListWindow(3,modes,str1,str2,str3,hzIndex,6);
}//二级菜单：闹钟设置
void menu_ymsz(void){
	u8 modes[3]={0,1,1};
	u8 str1[]="4.";
	u8 str2[]="5.";
	u8 str3[]="6.";
	u8 hzIndex[12]={youMen,men,sheZhi,zhi,xingCheng,chengDu,jiaoZhun,zhun,huiFu,fuXing,moRen,ren};
	menuListWindow(4,modes,str1,str2,str3,hzIndex,6);
}//二级菜单：油门设置
void menu_xcjz(void){
	u8 modes[3]={1,0,1};
	u8 str1[]="4.";
	u8 str2[]="5.";
	u8 str3[]="6.";
	u8 hzIndex[12]={youMen,men,sheZhi,zhi,xingCheng,chengDu,jiaoZhun,zhun,huiFu,fuXing,moRen,ren};
	menuListWindow(5,modes,str1,str2,str3,hzIndex,6);
}//二级菜单：行程校准
void menu_hfcc(void){
	u8 modes[3]={1,1,0};
	u8 str1[]="4.";
	u8 str2[]="5.";
	u8 str3[]="6.";
	u8 hzIndex[12]={youMen,men,sheZhi,zhi,xingCheng,chengDu,jiaoZhun,zhun,huiFu,fuXing,moRen,ren};
	menuListWindow(6,modes,str1,str2,str3,hzIndex,6);
}//二级菜单：恢复出厂设置
/*
hzIndex：16个汉字在数组中的索引
mode：三行的显示模式
*/
void line3Window(u8 hzIndex[],u8 mode[])
{
	//第一行
	OLED_Fill(0,0,31,15,1);//顶部填充
	u8 line1Index[]={hzIndex[0],hzIndex[1],hzIndex[2],hzIndex[3]};
	OLED_ShowChineseWords(32,0,line1Index,4,0);
	OLED_Fill(96,0,127,15,1);//顶部填充
	//第二行
	OLED_ShowString(0,16,(u8 *)"1.",16,mode[0]);
	u8 line2Index[]={hzIndex[4],hzIndex[5],hzIndex[6],hzIndex[7]};
	OLED_ShowChineseWords(16,16,line2Index,4,mode[0]);
	//第三行
	OLED_ShowString(0,32,(u8 *)"2.",16,mode[1]);
	u8 line3Index[]={hzIndex[8],hzIndex[9],hzIndex[10],hzIndex[11]};
	OLED_ShowChineseWords(16,32,line3Index,4,mode[1]);
	//第四行
	OLED_ShowString(0,48,(u8 *)"3.",16,mode[2]);
	u8 line4Index[]={hzIndex[12],hzIndex[13],hzIndex[14],hzIndex[15]};
	OLED_ShowChineseWords(16,48,line4Index,4,mode[2]);
}

void menu_wtdw(void){
	u8 hzIndex[16]={changYong,yong,sheZhi,zhi,weiTiao,tiao,dan,weiZhi,an,jianPan,yin,xiao,kai,jiQi,hua,mian};
	u8 modes[3] = {0,1,1};
	line3Window(hzIndex, modes);
	OLED_ShowNum(88,16,setData.PWMadjustUnit,1,16);
}//三级菜单：微调单位
void menu_ajyx(void){
	u8 hzIndex[16]={changYong,yong,sheZhi,zhi,weiTiao,tiao,dan,weiZhi,an,jianPan,yin,xiao,kai,jiQi,hua,mian};
	u8 modes[3] = {1,0,1};
	line3Window(hzIndex, modes);
}//三级菜单：按键音效
void menu_kjhm(void){
	u8 hzIndex[16]={changYong,yong,sheZhi,zhi,weiTiao,tiao,dan,weiZhi,an,jianPan,yin,xiao,kai,jiQi,hua,mian};
	u8 modes[3] = {1,1,0};
	line3Window(hzIndex, modes);
}//三级菜单：开机画面

void menu_dyjz(void){
	u8 hzIndex[16]={dian,ya,sheZhi,zhi,dian,ya,jiaoZhun,zhun,baoJing,jing,dian,ya,jie,shouDao,baoJing,jing};
	u8 modes[3] = {0,1,1};
	line3Window(hzIndex, modes);
	sprintf((char *)batVoltStr,"%2.2fV",batVolt);
	OLED_ShowString(88,16, (u8 *)batVoltStr,16,1);
	sprintf((char *)batVoltStr,"%2.2fV",setData.warnBatVolt);
	OLED_ShowString(88,32, (u8 *)batVoltStr,16,1);
	sprintf((char *)batVoltStr,"%2.2fV",setData.warnBatVolt);//飞机的电池报警
	OLED_ShowString(88,48, (u8 *)batVoltStr,16,1);
}//三级菜单：电压校准
void menu_bjdy(void){
	u8 hzIndex[16]={dian,ya,sheZhi,zhi,dian,ya,jiaoZhun,zhun,baoJing,jing,dian,ya,jie,shouDao,baoJing,jing};
	u8 modes[3] = {1,0,1};
	line3Window(hzIndex, modes);
	sprintf((char *)batVoltStr,"%2.2fV",setData.warnBatVolt);
	OLED_ShowString(88,32, (u8 *)batVoltStr,16,1);
}//三级菜单：报警电压
void menu_jsbj(void){
	u8 hzIndex[16]={dian,ya,sheZhi,zhi,dian,ya,jiaoZhun,zhun,baoJing,jing,dian,ya,jie,shouDao,baoJing,jing};
	u8 modes[3] = {1,1,0};
	line3Window(hzIndex, modes);
	sprintf((char *)batVoltStr,"%2.2fV",setData.warnBatVolt);//飞机的电池报警
	OLED_ShowString(88,48, (u8 *)batVoltStr,16,1);
}//三级菜单：接收报警
	
void menu_nzbj(void){
	u8 hzIndex[16]={nao,zhongDian,sheZhi,zhi,nao,zhongDian,baoJing,jing,nao,zhongDian,shiChang,changDu,kai,jiQi,zi,jianCha};
	u8 modes[3] = {0,1,1};
	line3Window(hzIndex, modes);
}//三级菜单：闹钟报警
void menu_nzsc(void){
	u8 hzIndex[16]={nao,zhongDian,sheZhi,zhi,nao,zhongDian,baoJing,jing,nao,zhongDian,shiChang,changDu,kai,jiQi,zi,jianCha};
	u8 modes[3] = {1,0,1};
	line3Window(hzIndex, modes);
}//三级菜单：闹钟时长
void menu_kjzj(void){
	u8 hzIndex[16]={nao,zhongDian,sheZhi,zhi,nao,zhongDian,baoJing,jing,nao,zhongDian,shiChang,changDu,kai,jiQi,zi,jianCha};
	u8 modes[3] = {1,1,0};
	line3Window(hzIndex, modes);
}//三级菜单：开机自检
	
