J20RC/STM32_RC_Transmitter/software/Config/menu.c
void menu_ymph(void){
	u8 hzIndex[16]={youMen,men,sheZhi,zhi,youMen,men,pian,hao,youMen,men,qu,xian,shiQu,kong,baoCun,hu};
	u8 modes[3] = {0,1,1};
	line3Window(hzIndex, modes);
	if(setData.throttlePreference)OLED_ShowChinese(88,16,zuo,16,1);//左
	else OLED_ShowChinese(88,16,youShou,16,1);//右
	OLED_ShowChinese(104,16,shouJi,16,1);//手
}//三级菜单：油门偏好
void menu_ymqx(void){
	u8 hzIndex[16]={youMen,men,sheZhi,zhi,youMen,men,pian,hao,youMen,men,qu,xian,shiQu,kong,baoCun,hu};
	u8 modes[3] = {1,0,1};
	line3Window(hzIndex, modes);
}//三级菜单：油门曲线
void menu_skbh(void){
	u8 hzIndex[16]={youMen,men,sheZhi,zhi,youMen,men,pian,hao,youMen,men,qu,xian,shiQu,kong,baoCun,hu};
	u8 modes[3] = {1,1,0};
	line3Window(hzIndex, modes);
}//三级菜单：失控保护

void menu_xcjzTip(void){
	OLED_Fill(0,0,127,63,0);//清空
	OLED_ShowString(0,0, (u8 *)"1.",16,1);
	u8 qjyghzIndex[] = {qing,jiang,yao,gan,huiLai,zhongXin};
	OLED_ShowChineseWords(16,0,qjyghzIndex,6,1);
	OLED_ShowString(112,0, (u8 *)",",16,1);
	u8 bkymtdIndex[]={baoKuo,kuo,youMen,men,tongDao,dao};
	OLED_ShowChineseWords(16,16,bkymtdIndex,6,1);
	OLED_ShowString(0,32, (u8 *)"2.",16,1);
	u8 qjjsjddIndex[]={qing,jiang,jie,shouDao,jiQi,duan,dian};
	OLED_ShowChineseWords(16,32,qjjsjddIndex,7,1);
	OLED_ShowChinese(0,48,an,16,1);
	OLED_ShowString(16,48, (u8 *)"Enter",16,1);
	u8 jxIndex[]={jiXu,xu};
	OLED_ShowChineseWords(56,48,jxIndex,2,1);
}//三级菜单：请将遥杆回中
void menu_xcjz14(void){
	OLED_ShowString(2,0, (u8 *)"1:",16,1);
	OLED_ShowNum(18,0,setData.chLower[0],4,16);
	OLED_ShowNum(56,0,setData.chMiddle[0],4,16);
	OLED_ShowNum(95,0,setData.chUpper[0],4,16);
	
	OLED_ShowString(2,16, (u8 *)"2:",16,1);
	OLED_ShowNum(18,16,setData.chLower[1],4,16);
	OLED_ShowNum(56,16,setData.chMiddle[1],4,16);
	OLED_ShowNum(95,16,setData.chUpper[1],4,16);
	
	OLED_ShowString(2,32, (u8 *)"3:",16,1);
	OLED_ShowNum(18,32,setData.chLower[2],4,16);
	OLED_ShowNum(56,32,setData.chMiddle[2],4,16);
	OLED_ShowNum(95,32,setData.chUpper[2],4,16);
	
	OLED_ShowString(2,48, (u8 *)"4:",16,1);
	OLED_ShowNum(18,48,setData.chLower[3],4,16);
	OLED_ShowNum(56,48,setData.chMiddle[3],4,16);
	OLED_ShowNum(95,48,setData.chUpper[3],4,16);
}//三级菜单：通道1-4显示

void menu_hfccTip(void){
	OLED_Fill(0,0,127,63,0);//清空
	u8 jhfmrszIndex[]={jiang,huiFu,fuXing,moRen,ren,sheZhi,zhi};
	OLED_ShowChineseWords(0,16,jhfmrszIndex,7,1);
	OLED_ShowChinese(0,32,an,16,1);
	OLED_ShowString(16,32, (u8 *)"Enter",16,1);
	u8 jxIndex[]={jiXu,xu};
	OLED_ShowChineseWords(56,32,jxIndex,2,1);
}//三级菜单：将恢复默认
void menu_hfcg(void){
	OLED_Fill(0,0,127,63,0);//清空
	u8 hfcgIndex[]={huiFu,fuXing,chengGong,gong};
	OLED_ShowChineseWords(32,24,hfcgIndex,4,1);
}//三级菜单：恢复成功

void menu_gybjInf(void){
	OLED_Fill(0,0,127,63,0);//清空
	OLED_ShowString(0,0, (u8 *)"J20RC",16,1);
	u8 hfcgIndex[]={kai,fa,tuan,dui};
	OLED_ShowChineseWords(40,0,hfcgIndex,4,1);
	OLED_ShowString(0,16, (u8 *)"2020.10.01",16,1);
	OLED_ShowString(0,32, (u8 *)"V2.0",16,1);
}//三级菜单：J20RC开发团队-V2.0
